[
  {
    "product_id": "BB001",
    "name": "Bean Bag Soft and comfortable Lounger chair",
    "description": "Sink into ultimate comfort with our luxuriously soft and incredibly stylish Beanie Chair. This lounger is ergonomically designed to perfectly conform to your body's shape, providing unparalleled support and relaxation. Whether you're settling in for a movie marathon, diving into a good book, studying for exams, or gearing up for an intense gaming session, this bean bag is the ideal companion for any casual setting. Its durable yet cozy fabric makes it a perfect addition to any living room, dorm room, or play area.",
    "category": "Furniture",
    "price": 360.00,
    "currency": "₱",
    "rating": 4.5,
    "review_count": 199,
    "image_filename": "bean.jpg",
    "thumbnails": ["beanorange.jpg", "beanblue.jpg", "beanblack.jpg", "beanred.jpg"],
    "colors": ["#6b7a4c", "#e39383", "#b0d3e2", "#4c4c4c", "#a23b3b"],
    "available_colors": [
      { "color_name": "Green", "image_filename": "bean.jpg" },
      { "color_name": "Red/Orange", "image_filename": "beanorange.jpg" },
      { "color_name": "Light Blue", "image_filename": "beanblue.jpg" },
      { "color_name": "Dark Gray", "image_filename": "beanblack.jpg" },
      { "color_name": "Red", "image_filename": "beanred.jpg" }
    ]
  },
  {
    "product_id": "CL001",
    "name": "Omo Laundry Powder Ultra Fast Clean 800g",
    "description": "Experience the superior cleaning power of Omo Laundry Powder Ultra Fast Clean. This 800g pack is formulated with advanced technology to tackle even the most stubborn and tough stains, delivering a brilliantly clean wash faster than ever. Despite its powerful action, it remains surprisingly gentle on your hands, making your laundry routine more comfortable. It dissolves quickly, penetrates deep into fibers, and leaves your clothes smelling fresh and looking vibrant.",
    "category": "Cleaning Supplies",
    "price": 140.00,
    "currency": "₱",
    "rating": 4.8,
    "review_count": 55,
    "image_filename": "detergent.jpg",
    "thumbnails": [],
    "colors": [],
    "available_colors": []
  },
  {
    "product_id": "HO002",
    "name": "Cottonelle Ultra Comfort Care Toilet Paper",
    "description": "Upgrade your bathroom experience with Cottonelle Ultra Comfort Care Toilet Paper. This pack features 4 rolls of premium, 2-ply toilet paper, renowned for its unique CleaningRipples texture that is designed to remove more and clean better. It's exceptionally soft, highly absorbent, and strong, ensuring a comfortable and confident clean every time. Stock up on this essential for a touch of everyday luxury and reliable performance.",
    "category": "Home Essentials",
    "price": 110.00,
    "currency": "₱",
    "rating": 4.6,
    "review_count": 102,
    "image_filename": "cotton.jpg",
    "thumbnails": [],
    "colors": [],
    "available_colors": []
  },
  {
    "product_id": "HO003",
    "name": "Febreze Air Freshener Aerosol Spray Exotic Bloom, 185ml",
    "description": "Transform your living space with the Febreze Air Freshener Aerosol Spray in Exotic Bloom. This 185ml spray doesn't just mask odors; it truly eliminates them with OdorClear Technology, leaving behind a light, pleasant, and long-lasting exotic floral scent. It's perfect for instantly refreshing any room, from the living room to the bathroom or kitchen, fighting tough lingering smells and ensuring your home always feels welcoming.",
    "category": "Home Essentials",
    "price": 60.00,
    "currency": "₱",
    "rating": 4.4,
    "review_count": 31,
    "image_filename": "airfreshner.jpg",
    "thumbnails": [],
    "colors": [],
    "available_colors": []
  },
  {
    "product_id": "CL004",
    "name": "Deep Cleaning Kitchen & Bathroom Washing Up Sponges",
    "description": "Tackle any cleaning challenge with these Deep Cleaning Kitchen & Bathroom Washing Up Sponges. This pack provides durable, dual-sided sponges designed for maximum versatility. One side features a tough, abrasive scrubber for powering through baked-on food, tough grime, and soap scum, while the other side is a soft, absorbent sponge perfect for gentle wiping, cleaning delicate surfaces, and creating a rich lather. They are built to last, making them an essential tool for a sparkling clean home.",
    "category": "Cleaning Supplies",
    "price": 180.00,
    "currency": "₱",
    "rating": 4.7,
    "review_count": 78,
    "image_filename": "sponge.jpg",
    "thumbnails": [],
    "colors": [],
    "available_colors": []
  },
  {
    "product_id": "OS005",
    "name": "Flower Notebook",
    "description": "Capture your thoughts, notes, and ideas in this beautiful Flower Notebook. It features a stylish and vibrant floral cover that adds a touch of personality to your supplies. Inside, you'll find high-quality, college-ruled pages, providing ample space for organized writing. It's the perfect size for carrying in a backpack or tote, making it an excellent choice for students taking lecture notes, professionals in meetings, or anyone who loves to journal.",
    "category": "Office/School Supplies",
    "price": 95.00,
    "currency": "₱",
    "rating": 4.2,
    "review_count": 15,
    "image_filename": "notebook.jpg",
    "thumbnails": [],
    "colors": [],
    "available_colors": []
  },
  {
    "product_id": "OS006",
    "name": "Borracha Escolar SuperSoft - FABER-CASTELL",
    "description": "Achieve perfection in your writing and drawing with the Borracha Escolar SuperSoft from FABER-CASTELL. This high-quality, premium eraser is engineered to be extra-soft, allowing it to cleanly lift graphite and pencil marks from the page with minimal pressure. It erases without smudging, smearing, or tearing your paper, making it an indispensable tool for students, artists, and professionals who demand precision and clean results.",
    "category": "Office/School Supplies",
    "price": 25.00,
    "currency": "₱",
    "rating": 4.9,
    "review_count": 220,
    "image_filename": "eraser.jpg",
    "thumbnails": [],
    "colors": [],
    "available_colors": []
  },
  {
    "product_id": "OS007",
    "name": "Black School Backpack",
    "description": "Carry all your essentials with ease in this classic Black School Backpack. Built from durable materials to withstand the rigors of daily use, this backpack is both spacious and practical. It features a large main compartment for books and binders, along with multiple smaller compartments and pockets to keep your pens, gadgets, and personal items organized and easily accessible. The padded shoulder straps are adjustable for a comfortable fit, making it the perfect, reliable choice for school, college, or casual day trips.",
    "category": "Office/School Supplies",
    "price": 750.00,
    "currency": "₱",
    "rating": 4.5,
    "review_count": 48,
    "image_filename": "backpack.jpg",
    "thumbnails": [],
    "colors": [],
    "available_colors": []
  },
  {
    "product_id": "OS008",
    "name": "Assorted Sticky Notes",
    "description": "Stay organized and keep your priorities in sight with this versatile set of Assorted Sticky Notes. This pack includes multiple pads in various bright, eye-catching colors, making it easy to color-code your tasks or notes. The reliable adhesive allows you to stick them almost anywhere—in textbooks, on your monitor, or on documents—without leaving a messy residue. They are perfect for marking important pages, leaving quick reminders, and organizing your study or work projects.",
    "category": "Office/School Supplies",
    "price": 80.00,
    "currency": "₱",
    "rating": 4.3,
    "review_count": 33,
    "image_filename": "sticky notes.jpg",
    "thumbnails": [],
    "colors": [],
    "available_colors": []
  },
  {
    "product_id": "HS009",
    "name": "Colgate Triple Action Toothpaste",
    "description": "Protect your smile with the trusted power of Colgate Triple Action Toothpaste. This fluoride toothpaste delivers three key benefits in one tube for a comprehensive, deep clean. It provides proven cavity protection, helps whiten teeth by gently removing surface stains, and freshens your breath with a refreshing Original Mint flavor that lasts. Make this toothpaste a staple in your daily oral care routine for a healthy, clean, and confident mouth.",
    "category": "Health & Beauty",
    "price": 120.00,
    "currency": "₱",
    "rating": 4.5,
    "review_count": 88,
    "image_filename": "colgate.jpg",
    "thumbnails": [],
    "colors": [],
    "available_colors": []
  },
  {
    "product_id": "HS010",
    "name": "Essential Moisturizing Bar Soap",
    "description": "Indulge your skin with this Essential Moisturizing Bar Soap. Unlike ordinary soaps that can strip skin of its moisture, this bar is specially formulated with hydrating ingredients to gently cleanse your skin while helping to maintain its natural moisture barrier. It washes away dirt and bacteria effectively, leaving your skin feeling soft, smooth, and refreshed, never tight or dry. It is suitable for daily use on your face, hands, and body.",
    "category": "Health & Beauty",
    "price": 55.00,
    "currency": "₱",
    "rating": 4.1,
    "review_count": 12,
    "image_filename": "soap.jpg",
    "thumbnails": [],
    "colors": [],
    "available_colors": []
  },
  {
    "product_id": "HO011",
    "name": "Decorative Storage Basket",
    "description": "Bring order and style to your home with this Decorative Storage Basket. This beautifully woven basket offers a chic and practical solution for managing clutter. Its sturdy construction and ample size make it perfect for a variety of uses, from holding laundry in the bedroom, organizing children's toys in the playroom, or storing extra blankets, pillows, and magazines in the living room. The neutral design and natural texture complement any home decor, from modern to rustic.",
    "category": "Home Essentials",
    "price": 250.00,
    "currency": "₱",
    "rating": 4.0,
    "review_count": 22,
    "image_filename": "basket.png",
    "thumbnails": [],
    "colors": [],
    "available_colors": []
  },
  {
    "product_id": "OS012",
    "name": "Premium Writing Pen Set",
    "description": "Elevate your writing experience with this Premium Writing Pen Set. Each pen in the set is designed to deliver an exceptionally smooth, consistent flow of ink, ensuring your writing is clear and skip-free. The comfortable, ergonomic grip and balanced weight reduce hand fatigue, making this set ideal for long journaling sessions, extensive note-taking in class, or for bringing a touch of professionalism to your office work. This set is a reliable choice for anyone who values quality and clarity.",
    "category": "Office/School Supplies",
    "price": 150.00,
    "currency": "₱",
    "rating": 4.7,
    "review_count": 65,
    "image_filename": "pen.png",
    "thumbnails": [],
    "colors": [],
    "available_colors": []
  },
  {
    "product_id": "CL013",
    "name": "Ultra Absorbent Bath Towel",
    "description": "Wrap yourself in plush comfort with this Ultra Absorbent Bath Towel. Made from high-quality, 100% cotton, this towel feels incredibly soft against your skin while offering exceptional absorbency. It's designed to dry you off quickly and efficiently after a bath or shower. Durable, machine-washable, and quick-drying, this towel is a perfect, practical addition to any bathroom and is built to withstand everyday use while maintaining its softness.",
    "category": "Home Essentials",
    "price": 300.00,
    "currency": "₱",
    "rating": 4.4,
    "review_count": 40,
    "image_filename": "towel.jpg",
    "thumbnails": [],
    "colors": [],
    "available_colors": []
  },
  {
    "product_id": "HS014",
    "name": "Adult Toothbrush (Pack of 4)",
    "description": "Maintain excellent oral hygiene with this Adult Toothbrush 4-pack. Each toothbrush features durable, medium-bristle tufts designed to effectively clean tooth surfaces, remove plaque, and gently massage the gums. The brushes are engineered to reach all areas of your mouth for a thorough clean. The ergonomic handle provides a comfortable and secure grip, allowing for better control while brushing. This multi-pack ensures you always have a fresh toothbrush on hand, as recommended by dentists.",
    "category": "Health & Beauty",
    "price": 120.00,
    "currency": "₱",
    "rating": 4.3,
    "review_count": 28,
    "image_filename": "toothbrush.jpg",
    "thumbnails": [],
    "colors": [],
    "available_colors": []
  }
]